package handler

import (
	"github.com/gin-gonic/gin"
	"log"
)

func (h *Handler) Ping(c *gin.Context) {
	c.JSON(200, gin.H{
		"message": "PROOOOOOOOOOOOOOOOOD",
	})
	log.Println(`Мне тут было нечем заняться и я решил написать лог про что-то, я понял, что мне уже 
						лень делать чето осмысленное, мне осталось где-то 12 минут в 22.01.2025 я буду прогать 10 часов.
						О чем я могу с тобой поговорить, путник? В первую очередь о том, что я очень пытаюсь и старраюсь
						написать это проект очень красиво, чтобы он мне нравился, и я получил истинное удовольстве от процесса.
						Я подумал и понял, что даже если я не пройду в финнал, то это будет очень интересеный опыт,
						спасибо prod-у за это. Я надеюсь что этот проект поможет мне составить конкуренцию п*тону, который пока
						что с отрывом обгоняет go у меня в вакатайме. Еще 7 минут надо чето писать. Сестра решил надо 
						мной подшутить и сказала, что она ложиться спать. Отец раскрыл ее коварный замысел. Сегодян я скину
						скри с 10 часами кое-кому, надеюсь мне получиться с ним/ней завязать разговор, уж большо хочеться
						пообщеться. Сегодня вышел на улицу, там было свежо и прохладно, мне понравилось, я даже посидел
						с продуктами на лавочке (я выходил в магаз за колой). Я на prod-е наешл одного человека, он добрый
						отзывчивый и пишет на go)), правда на chi, но на go он перешел, не пресдавляешь, так же как и я
						с п*тухона летом, забавно, не так ли? Еще на предложении про выход на улицу было 4 минуты, вакатайм
						не обновился, поэтому до сих пор 4. Скоро мы закончил наш прекрасный диалог. Знаешь, если ты это читаешь
						и реально дошел до сюда, искрнне желаю тебе всего наилушчего (аааа руки болят от печти), пусть мой код
						тебе поможет или научит на ошибках, исполняться все твои мечты и все будет так, как хочешь
						всегда делай как зочешь именно ты, не слушай других, плыви против течения...
						На вакатайме осталась одна минут, время прощаться, на часах 23:45, уже после полуночи, я надеюсь,
						я закрою либо правки свои же, либо какой-то эгдпойнт. Кстати насчет того типа, который пишет на
						chi, надеюсь я смогу с ним подружиться, он крутой. 
						Все. 10 часов и 1 минут (внутренний перфекционист погиб). Удачи тебе и всего наилучшего!
						Твой Willyamdevon (если хочешь поговорить, то вот tg: go_py_kosty (напиши мне что ты прочитал 
						это сообщений, мне будет приятно вспомнить об это моменте и пообщеться с тобой))"`)
}
